Revit 2024 API
BuiltInFailures.FamilyFailures.InvalidInsertOrientation Property
 The insert orientation is incompatible with the wall's cross-section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidInsertOrientation { get; }
Visual Basic
Public Shared ReadOnly Property InvalidInsertOrientation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidInsertOrientation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace